#+TITLE: GnuPG - Paypal donation summry
#+STARTUP: showall
#+SETUPFILE: "../share/setup.inc"

#+HTML: <!--table_data_wideright-->

*** Paypal separated by currency

 | Year | Mon |   EUR | fee | GBP | fee |  USD | fee |   JPY |  fee |  nEUR | nGBP | nUSD | nJPY |   xUSD |    xGBP |   xJPY | total |
 |------+-----+-------+-----+-----+-----+------+-----+-------+------+-------+------+------+------+--------+---------+--------+-------|
 | 2017 |  01 |   145 |  12 |     |     | 1394 |  73 |   500 |  100 |   133 |    0 | 1228 |    3 | 1.0755 | 0.86105 | 121.94 |  1364 |
 |      |  02 |    85 |   6 |  10 |   1 |  110 |   7 |       |      |    79 |   11 |   97 |    0 | 1.0597 | 0.85305 | 118.83 |   187 |
 |      |  03 |   225 |  13 |     |     |   20 |   1 |       |      |   212 |    0 |   18 |    0 | 1.0691 | 0.85553 | 119.55 |   230 |
 |      |  04 |   139 |   5 |   5 |   0 |   10 |   1 |       |      |   134 |    6 |    8 |    0 |  1.093 | 0.84473 | 121.76 |   148 |
 |      |  05 |    55 |   3 |     |     |   26 |   2 |       |      |    52 |    0 |   21 |    0 | 1.1221 | 0.87365 |  124.4 |    73 |
 |      |  06 | 11140 | 439 | 158 |   9 | 3148 | 161 | 61500 | 3700 | 10701 |  169 | 2617 |  452 | 1.1412 | 0.87933 | 127.75 | 13939 |
 |      |  07 |  4003 | 219 | 255 |  13 | 2838 | 143 | 15000 |  900 |  3784 |  271 | 2298 |  109 | 1.1727 |  0.8942 |  129.7 |  6462 |
 |      |  08 |  1952 | 119 | 120 |   7 | 1413 |  79 |  5000 |  300 |  1833 |  123 | 1128 |   36 | 1.1825 | 0.91973 | 130.81 |  3120 |
 |      |  09 |  2489 | 145 | 150 |   8 |  995 |  59 |       |      |  2344 |  161 |  793 |    0 | 1.1806 | 0.88178 | 132.82 |  3298 |
 |      |  10 |  1699 | 112 |  35 |   3 |  905 |  53 |       |      |  1587 |   36 |  732 |    0 | 1.1638 | 0.87853 |    132 |  2355 |
 |      |  11 |  1585 | 102 |  55 |   3 |  750 |  45 |       |      |  1483 |   59 |  595 |    0 | 1.1849 | 0.87985 | 133.08 |  2137 |
 |      |  12 |  7078 | 335 |  90 |   5 |  926 |  56 |       |      |  6743 |   96 |  725 |    0 | 1.1993 | 0.88723 | 135.01 |  7564 |
 | 2018 |  01 |  1902 | 116 |  36 |   3 |  855 |  50 |       |      |  1786 |   38 |  646 |    0 | 1.2457 |  0.8791 |  135.6 |  2470 |
 |      |  02 |  1493 |  97 |  54 |   3 |  660 |  39 |       |      |  1396 |   58 |  508 |    0 | 1.2214 | 0.88415 | 130.72 |  1962 |
 |      |  03 |  1762 | 110 |  50 |   3 | 2267 | 123 |       |      |  1652 |   54 | 1740 |    0 | 1.2321 |  0.8749 | 131.15 |  3446 |
 |      |  04 |  1763 | 104 |  35 |   2 |  735 |  44 |       |      |  1659 |   38 |  572 |    0 | 1.2079 |  0.8796 | 132.12 |  2269 |
 |      |  05 |  1638 |  98 |  35 |   2 |  797 |  47 |       |      |  1540 |   38 |  641 |    0 | 1.1699 |  0.8768 | 127.33 |  2219 |
 |      |  06 |  2025 | 117 |  65 |   4 |  795 |  46 | 15000 |  820 |  1908 |   69 |  642 |  110 | 1.1658 | 0.88605 | 129.04 |  2729 |
 |      |  07 |  1587 | 104 |  55 |   3 |  705 |  42 |       |      |  1483 |   58 |  567 |    0 | 1.1684 |  0.8907 | 129.79 |  2108 |
 |      |  08 |  1213 |  82 |  39 |   2 |  680 |  40 |  8100 |  460 |  1131 |   41 |  553 |   59 | 1.1571 |  0.8934 | 128.54 |  1784 |
 #+TBLFM: $11=$3-$4::$12=($5-$6)/$16;%.0f::$13=($7-$8)/$15;%.0f::$14=($9-$10)/$17;%.0f::$18=$11+$12+$13+$14

#+HTML: <div id="smallnote">
/nEUR/, /nGBP/, /nUSD/ and /nJPY/ are the net donations converted to
Euro using the exchange rate from the last banking day of the month
(/xUSD/,/xGBP/, /xJPL/ columns).  Actually received values may differ
because the conversion to Euro is triggered manually as needed.
Values are rounded to a full Euro, USD, Pound or to 100 Yen.
#+HTML: </div>


*** Exchange rates

Taken from the ZIP file found at [[https://www.ecb.europa.eu/stats/policy_and_exchange_rates/euro_reference_exchange_rates/html/index.en.html][ECB page]].

| Date        |    USD |     GBP |    JPY |
|-------------+--------+---------+--------|
| 2017-Jan-31 | 1.0755 | 0.86105 | 121.94 |
| 2017-Feb-28 | 1.0597 | 0.85305 | 118.83 |
| 2017-Mar-31 | 1.0691 | 0.85553 | 119.55 |
| 2017-Apr-28 |  1.093 | 0.84473 | 121.76 |
| 2017-May-31 | 1.1221 | 0.87365 |  124.4 |
| 2017-Jun-30 | 1.1412 | 0.87933 | 127.75 |
| 2017-Jul-31 | 1.1727 |  0.8942 |  129.7 |
| 2017-Aug-31 | 1.1825 | 0.91973 | 130.81 |
| 2017-Sep-29 | 1.1806 | 0.88178 | 132.82 |
| 2017-Oct-31 | 1.1638 | 0.87853 |    132 |
| 2017-Nov-30 | 1.1849 | 0.87985 | 133.08 |
| 2017-Dec-29 | 1.1993 | 0.88723 | 135.01 |
| 2018-Jan-31 | 1.2457 |  0.8791 |  135.6 |
| 2018-Feb-28 | 1.2214 | 0.88415 | 130.72 |
| 2018-Mar-29 | 1.2321 |  0.8749 | 131.15 |
| 2018-Apr-30 | 1.2079 |  0.8796 | 132.12 |
| 2018-May-31 | 1.1699 |  0.8768 | 127.33 |
| 2018-Jun-29 | 1.1658 | 0.88605 | 129.04 |
| 2018-Jul-30 | 1.1684 |  0.8907 | 129.79 |
| 2018-Aug-31 | 1.1571 |  0.8934 | 128.54 |
|             |        |         |        |
